Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cx_mtsh_db/src/packs/PIC32CX2051MTSH128_DFP/component/cmcc.h
/* -------- CMCC_MSR : (CMCC Offset: 0x34) ( R/ 32) Monitor Status Register -------- */
#define CMCC_MSR_EVENT_CNT_Pos                _UINT32_(0)                                          /* (CMCC_MSR) Monitor Event Counter Position */
#define CMCC_MSR_EVENT_CNT_Msk                (_UINT32_(0xFFFFFFFF) << CMCC_MSR_EVENT_CNT_Pos)     /* (CMCC_MSR) Monitor Event Counter Mask */
#define CMCC_MSR_EVENT_CNT(value)             (CMCC_MSR_EVENT_CNT_Msk & (_UINT32_(value) << CMCC_MSR_EVENT_CNT_Pos)) /* Assigment of value for EVENT_CNT in the CMCC_MSR register */
#define CMCC_MSR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (CMCC_MSR) Register Mask  */


/* -------- CMCC_WPMR : (CMCC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define CMCC_WPMR_WPCFG_Pos                   _UINT32_(0)                                          /* (CMCC_WPMR) Write Protection Configuration Enable Position */
#define CMCC_WPMR_WPCFG_Msk                   (_UINT32_(0x1) << CMCC_WPMR_WPCFG_Pos)               /* (CMCC_WPMR) Write Protection Configuration Enable Mask */
#define CMCC_WPMR_WPCFG(value)                (CMCC_WPMR_WPCFG_Msk & (_UINT32_(value) << CMCC_WPMR_WPCFG_Pos)) /* Assigment of value for WPCFG in the CMCC_WPMR register */
#define CMCC_WPMR_WPCR_Pos                    _UINT32_(2)                                          /* (CMCC_WPMR) Write Protection Control Enable Position */
#define CMCC_WPMR_WPCR_Msk                    (_UINT32_(0x1) << CMCC_WPMR_WPCR_Pos)                /* (CMCC_WPMR) Write Protection Control Enable Mask */
#define CMCC_WPMR_WPCR(value)                 (CMCC_WPMR_WPCR_Msk & (_UINT32_(value) << CMCC_WPMR_WPCR_Pos)) /* Assigment of value for WPCR in the CMCC_WPMR register */
#define CMCC_WPMR_WPKEY_Pos                   _UINT32_(8)                                          /* (CMCC_WPMR) Write Protection Key Position */
#define CMCC_WPMR_WPKEY_Msk                   (_UINT32_(0xFFFFFF) << CMCC_WPMR_WPKEY_Pos)          /* (CMCC_WPMR) Write Protection Key Mask */
#define CMCC_WPMR_WPKEY(value)                (CMCC_WPMR_WPKEY_Msk & (_UINT32_(value) << CMCC_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the CMCC_WPMR register */
#define   CMCC_WPMR_WPKEY_PASSWD_Val          _UINT32_(0x434D43)                                   /* (CMCC_WPMR) Writing any other value in this field aborts the write operation of the WPCFG and WPCR bits. Always reads as 0.  */
#define CMCC_WPMR_WPKEY_PASSWD                (CMCC_WPMR_WPKEY_PASSWD_Val << CMCC_WPMR_WPKEY_Pos)  /* (CMCC_WPMR) Writing any other value in this field aborts the write operation of the WPCFG and WPCR bits. Always reads as 0. Position  */
#define CMCC_WPMR_Msk                         _UINT32_(0xFFFFFF05)                                 /* (CMCC_WPMR) Register Mask  */


/** \brief CMCC register offsets definitions */
#define CMCC_TYPE_REG_OFST             _UINT32_(0x00)      /* (CMCC_TYPE) Cache Controller Type Register Offset */
#define CMCC_CFG_REG_OFST              _UINT32_(0x04)      /* (CMCC_CFG) Configuration Register Offset */
#define CMCC_CTRL_REG_OFST             _UINT32_(0x08)      /* (CMCC_CTRL) Control Register Offset */
#define CMCC_SR_REG_OFST               _UINT32_(0x0C)      /* (CMCC_SR) Status Register Offset */
#define CMCC_MAINT0_REG_OFST           _UINT32_(0x20)      /* (CMCC_MAINT0) Maintenance Register 0 Offset */
#define CMCC_MAINT1_REG_OFST           _UINT32_(0x24)      /* (CMCC_MAINT1) Maintenance Register 1 Offset */
#define CMCC_MCFG_REG_OFST             _UINT32_(0x28)      /* (CMCC_MCFG) Monitor Configuration Register Offset */
#define CMCC_MEN_REG_OFST              _UINT32_(0x2C)      /* (CMCC_MEN) Monitor Enable Register Offset */
#define CMCC_MCTRL_REG_OFST            _UINT32_(0x30)      /* (CMCC_MCTRL) Monitor Control Register Offset */
#define CMCC_MSR_REG_OFST              _UINT32_(0x34)      /* (CMCC_MSR) Monitor Status Register Offset */
#define CMCC_WPMR_REG_OFST             _UINT32_(0xE4)      /* (CMCC_WPMR) Write Protection Mode Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief CMCC register API structure */
typedef struct
{
  __I   uint32_t                       CMCC_TYPE;          /**< Offset: 0x00 (R/   32) Cache Controller Type Register */
  __IO  uint32_t                       CMCC_CFG;           /**< Offset: 0x04 (R/W  32) Configuration Register */
  __O   uint32_t                       CMCC_CTRL;          /**< Offset: 0x08 ( /W  32) Control Register */
  __I   uint32_t                       CMCC_SR;            /**< Offset: 0x0C (R/   32) Status Register */
  __I   uint8_t                        Reserved1[0x10];
  __O   uint32_t                       CMCC_MAINT0;        /**< Offset: 0x20 ( /W  32) Maintenance Register 0 */
  __O   uint32_t                       CMCC_MAINT1;        /**< Offset: 0x24 ( /W  32) Maintenance Register 1 */
  __IO  uint32_t                       CMCC_MCFG;          /**< Offset: 0x28 (R/W  32) Monitor Configuration Register */
  __IO  uint32_t                       CMCC_MEN;           /**< Offset: 0x2C (R/W  32) Monitor Enable Register */
  __O   uint32_t                       CMCC_MCTRL;         /**< Offset: 0x30 ( /W  32) Monitor Control Register */
  __I   uint32_t                       CMCC_MSR;           /**< Offset: 0x34 (R/   32) Monitor Status Register */
  __I   uint8_t                        Reserved2[0xAC];
  __IO  uint32_t                       CMCC_WPMR;          /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
} cmcc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTSH_CMCC_COMPONENT_H_ */
